cask_args appdir: "/Applications"

# Git
brew 'git'
brew 'hub'
brew 'git-cal'
brew 'git-extras'

# Setup some taps
tap 'caskroom/cask'

# Misc
brew 'apktool'
brew 'app-engine-python'
brew 'autoconf'
brew 'autoenv'
brew 'automake'
brew 'bcrypt'
brew 'certbot'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fdupes'
brew 'geoip'
brew 'geos'
brew 'go'
brew 'gpg-agent'
brew 'gpgme'
brew 'heroku'
brew 'htop-osx'
brew 'jq'
brew 'lua'
brew 'markdown'
brew 'mercurial'
brew 'mtr'
brew 'nmap'
brew 'openssl'
brew 'pidof'
brew 'proctools'
brew 'python'
brew 'python3'
brew 'readline'
brew 'ruby'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'sqlite'
brew 'sshuttle'
brew 'terminal-notifier'
brew 'tree'
brew 'yarn'
brew 'youtube-dl'

# Completions
brew 'bash-completion'
brew 'docker-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'django-completion'
brew 'fabric-completion'
brew 'gem-completion'
brew 'grunt-completion'
brew 'open-completion'
brew 'pip-completion'
brew 'rake-completion'
brew 'ruby-completion'

# Java
cask "java" unless system "/usr/libexec/java_home --failfast"

# Services
brew 'mysql@5.6'
brew 'node'
brew 'redis'

# Audio / Images / Video
brew 'exif'
brew 'exiftool'
brew 'faac'
brew 'flac'
brew 'imagesnap'
brew 'jpeg'
brew 'libjpeg'
brew 'libmagic'
brew 'libtiff'
brew 'pngcrush'
brew 'speex'
brew 'webp'
brew 'x264'
brew 'yasm'

# Do these after the others
brew 'imagemagick'
brew 'ffmpeg', args: ['with-speex']

# Override some system packages
brew 'bash'
brew 'curl'
brew 'grep'
brew 'less'
brew 'screen'
brew 'wget'

# iOS
brew 'chisel'
brew 'xctool'

# VIM
brew 'macvim'
brew 'the_silver_searcher'

# Quick Look Plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'receiptquicklook'
cask 'jupyter-notebook-ql'
cask 'quicklook-json'
cask 'quicklookapk'
cask 'suspicious-package'

# Some Mac apps
cask '1password'
cask 'adium'
cask 'adobe-creative-cloud'
cask 'adobe-digital-editions'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
cask 'arq'
cask 'atom'
cask 'aware'
cask 'balsamiq-mockups'
cask 'base'
cask 'calibre'
cask 'caskroom/versions/google-chrome-beta'
cask 'caskroom/versions/sublime-text-dev'
cask 'coconutbattery'
cask 'coderunner'
cask 'color-oracle'
cask 'dash'
cask 'deploymate'
cask 'divvy'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'focus'
cask 'google-drive'
cask 'handbrake'
cask 'hipchat'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'licecap'
cask 'messenger'
cask 'music-manager'
cask 'netspot'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'postgres'
cask 'sketch'
cask 'slack'
# cask 'caskroom/versions/slack-beta'
cask 'spotify'
cask 'transmission'
cask 'transmit'
cask 'vanilla'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'whatsapp'
cask 'wwdc'

# Others
# - Sonos: http://www.sonos.com/en-us/controller-app

