# Git
brew 'git'
brew 'hub'
brew 'git-extras'

# Setup some taps
tap 'caskroom/cask'
tap 'homebrew/completions'
tap 'homebrew/dupes'

# Misc
brew 'autoconf'
brew 'autoenv'
brew 'automake'
brew 'Caskroom/cask/r'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'curl'
brew 'diff-so-fancy'
brew 'fish'
brew 'geoip'
brew 'geos'
brew 'git-cal'
brew 'go'
brew 'google-app-engine'
brew 'heroku'
brew 'heroku-toolbelt'
brew 'htop'
brew 'htop-osx'
brew 'jq'
brew 'lua'
brew 'markdown'
brew 'mercurial'
brew 'mtr'
brew 'nmap'
brew 'pidof'
brew 'proctools'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'terminal-notifier'
brew 'tmux'
brew 'wget'
brew 'youtube-dl'

# Completions
brew 'bash-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'django-completion'
brew 'fabric-completion'
brew 'gem-completion'
brew 'grunt-completion'
brew 'open-completion'
brew 'pip-completion'
brew 'rake-completion'
brew 'ruby-completion'
brew 'tmuxinator-completion'
brew 'vagrant-completion'

# Java
brew 'Caskroom/cask/java'

# Services
brew 'memcached'
brew 'mysql'
brew 'node'
brew 'rabbitmq'
brew 'redis'
brew 'solr'
brew 'zeromq'

# Images / Video
brew 'exif'
brew 'exiftool'
brew 'imagesnap'
brew 'jpeg'
brew 'libjpeg'
brew 'libmagic'
brew 'libtiff'
brew 'pngcrush'
brew 'speex'
brew 'webp'
brew 'x264'
brew 'yasm'

# Do these after the others
brew 'imagemagick'
brew 'ffmpeg', args: ['with-speex']

# Override some system packages
brew 'grep'
brew 'less'
brew 'screen'

# Android
brew 'android-sdk'
brew 'gradle'

# iOS
brew 'chisel'
brew 'class-dump'
brew 'ios-sim'
brew 'xctool'

# VIM
brew 'macvim'
brew 'the_silver_searcher'

# Quick Look Plugins
#cask install qlcolorcode
#cask install qlstephen
#cask install qlmarkdown
#cask install quicklook-json
#cask install qlprettypatch
#cask install quicklook-csv
#cask install betterzipql
#cask install webp-quicklook
#cask install suspicious-package
#cask install ipaql

# Some Mac apps
#cask install --appdir=/Applications alfred
#cask install --appdir=/Applications android-file-transfer
#cask install --appdir=/Applications android-studio
#cask install --appdir=/Applications arq
#cask install --appdir=/Applications balsamiq-mockups
#cask install --appdir=/Applications base
#cask install --appdir=/Applications calibre
#cask install --appdir=/Applications chromecast
#cask install --appdir=/Applications coconutbattery
#cask install --appdir=/Applications color-oracle
#cask install --appdir=/Applications crashlytics
#cask install --appdir=/Applications divvy
#cask install --appdir=/Applications dropbox
#cask install --appdir=/Applications gitx
#cask install --appdir=/Applications hipchat
#cask install --appdir=/Applications imageoptim
#cask install --appdir=/Applications keyremap4macbook
#cask install --appdir=/Applications macvim
#cask install --appdir=/Applications rdio
#cask install --appdir=/Applications sequel-pro
#cask install --appdir=/Applications timemachinescheduler
#cask install --appdir=/Applications vlc

# Alternate versions
tap 'homebrew/versions'
